# ApplicableSegmentLengthRoundingMethod Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricRoundingManager..::..ApplicableSegmentLengthRoundingMethod Property
FabricRoundingManager Class See Also
---
The applicable rounding method for fabric segments.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public RoundingMethod ApplicableSegmentLengthRoundingMethod { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ApplicableSegmentLengthRoundingMethod As RoundingMethod
	Get
```

Visual C++
---
```text
public:
property RoundingMethod ApplicableSegmentLengthRoundingMethod {
	RoundingMethod get ();
}
```

# Remarks
IsActiveOnElement property of ReinforcementSettings RebarRoundingManager has to be true. ApplicableSegmentLengthRoundingMethod is meaningless if ReinforcementSettings RebarRoundingManager IsActiveOnElement is false.
# See Also
FabricRoundingManager Class
Autodesk.Revit.DB.Structure Namespace